Tekla.Structures.Model.UI.View.DisplayOrientationType
The view plane types.
The plane type can be changed.

Tekla.Structures.Model.UI.View.DisplayOrientationType.DISPLAY_VIEW_PLANE
The display orientation is in the view plane defined by the view coordinate system.

Tekla.Structures.Model.UI.View.DisplayOrientationType.DISPLAY_3D
The display orientation is in 3D defined by the display coordinate system.